const sessionInfo = {
    title: "Расписание летней сессии",
    dates: "с 26.05.2025 по 11.06.2025"
};

const lastUpdatedDate = "Информация актуальна на 13.06.2025</ br>Автоматическое обновление данных не предусмотрено"

const scheduleZis231Data = [
  { date: "26.05.2025", subject: "Архитектура вычислительных систем", time: "10:00-11:30", classroom: "529М", teacher: "Добрынин А.С." },
  { date: "26.05.2025", subject: "Базы данных", time: "12:00-13:30", classroom: "507М", teacher: "Маслова Е.В." },
  { date: "26.05.2025", subject: "Базы данных", time: "13:50-15:20", classroom: "507М", teacher: "Маслова Е.В." },
  { date: "26.05.2025", subject: "Компьютерное геометрическое моделирование", time: "15:30-17:00", classroom: "343ГТ", teacher: "Спиридонов В.В." },
  { date: "27.05.2025", subject: "Технологии программирования", time: "12:00-13:30", classroom: "526М", teacher: "Ляховец М.В.", type: "уст.з." },
  { date: "27.05.2025", subject: "Организационная психология", time: "13:50-15:20", classroom: "439Г", teacher: "Хомичева В.Е.", type: "зачет" },
  { date: "28.05.2025", subject: "Базы данных", time: "15:30-17:00", classroom: "507М", teacher: "Маслова Е.В.", type: "защита КР" },
  { date: "29.05.2025", subject: "Организационное собрание по практике", time: "10:00-11:30", classroom: "526М", teacher: "Тараборина Е.Н." },
  { date: "29.05.2025", subject: "Методы принятия решений и управление организационными системами", time: "12:00-13:30", classroom: "542М", teacher: "Шакиров М.К." },
  { date: "29.05.2025", subject: "Проектная деятельность 1", time: "13:50-15:20", classroom: "401М", teacher: "Фефелова Т.Е." },
  { date: "29.05.2025", subject: "Проектная деятельность 1", time: "15:30-17:00", classroom: "401М", teacher: "Фефелова Т.Е." },
  { date: "30.05.2025", subject: "Методы принятия решений и управление организационными системами", time: "10:00-11:30", classroom: "404М", teacher: "Шакиров М.К." },
  { date: "30.05.2025", subject: "Теория вероятности и математическая статистика", time: "12:00-13:30", classroom: "217аГ", teacher: "Цветков А.Б." },
  { date: "30.05.2025", subject: "Теория вероятности и математическая статистика", time: "13:50-15:20", classroom: "217аГ", teacher: "Цветков А.Б." },
  { date: "30.05.2025", subject: "Устойчивое развитие общества", time: "15:30-17:00", classroom: "639ГТ", teacher: "Жданова Н.Г.", type: "зачет" },
  { date: "31.05.2025", subject: "Компьютерное геометрическое моделирование", time: "10:00-11:30", classroom: "343ГТ", teacher: "Тараборина Е.Н.", type: "экзамен" },
  { date: "01.06.2025" },
  { date: "02.06.2025", subject: "Технологии сбора и обмена информацией в системах больших данных", time: "10:00-11:30", classroom: "529М", teacher: "Добрынин А.С." },
  { date: "02.06.2025", subject: "Проектная деятельность 1", time: "12:00-13:30", classroom: "403М", teacher: "Фефелова Т.Е." },
  { date: "02.06.2025", subject: "Основы программирования", time: "13:50-15:20", classroom: "506М", teacher: "Мартусевич Е.А." },
  { date: "02.06.2025", subject: "Основы программирования", time: "15:30-17:00", classroom: "506М", teacher: "Мартусевич Е.А." },
  { date: "03.06.2025", subject: "Операционные системы", time: "12:00-13:30", classroom: "1П", teacher: "Сеченов П.А." },
  { date: "03.06.2025", subject: "Архитектура вычислительных систем", time: "13:50-15:20", classroom: "401М", teacher: "Добрынин А.С." },
  { date: "03.06.2025", subject: "Теория вероятности и математическая статистика", time: "15:30-17:00", classroom: "216Г", teacher: "Цветков А.Б.", type: "экзамен" },
  { date: "04.06.2025", subject: "Методы принятия решений и управление организационными системами", time: "13:50-15:20", classroom: "404М", teacher: "Шакиров М.К." },
  { date: "04.06.2025", subject: "Философия", time: "15:30-17:00", classroom: "419Г", teacher: "Пашина Л.А.", type: "зачет с оценкой" },
  { date: "05.06.2025", subject: "Основы программирования", time: "12:00-13:30", classroom: "216Г", teacher: "Мартусевич Е.А.", type: "зачет" },
  { date: "06.06.2025", subject: "Проектная деятельность 1", time: "12:00-13:30", classroom: "404М", teacher: "Зимин В.В., Зимин А.В.", type: "защита КП" },
  { date: "07.06.2025", subject: "Методы принятия решений и управление организационными системами", time: "10:00-11:30", classroom: "521М", teacher: "Шакиров М.К.", type: "защита КР" },
  { date: "08.06.2025" },
  { date: "09.06.2025", subject: "Python для анализа данных", time: "10:00-11:30", classroom: "503М", teacher: "Гусев М.М." },
  { date: "09.06.2025", subject: "Современные СУБД и хранилища данных", time: "12:00-13:30", classroom: "526М", teacher: "Прохоров И.М." },
  { date: "09.06.2025", subject: "Архитектура вычислительных систем", time: "13:50-15:20", classroom: "401М", teacher: "Добрынин А.С." },
  { date: "09.06.2025", subject: "Правоведение", time: "15:30-17:00", classroom: "428Г", teacher: "Тресвятский Л.А.", type: "зачет" },
  { date: "10.06.2025", subject: "Архитектура вычислительных систем", time: "13:50-15:20", classroom: "529М", teacher: "Добрынин А.С.", type: "экзамен" },
  { date: "11.06.2025", subject: "Методы принятия решений и управление организационными системами", time: "10:00-11:30", classroom: "542М", teacher: "Шакиров М.К.", type: "экзамен" },
];

const scheduleZis232Data = [
  { date: "01.09.2025", subject: "Высшая математика", time: "12:00-13:30", classroom: "302", teacher: "Смирнов И.К." },
  { date: "01.09.2025", subject: "Основы алгоритмизации", time: "12:00-13:30", classroom: "401", teacher: "Ковалева А.С." },
  { date: "02.09.2025", subject: "Дискретная математика", time: "12:00-13:30", classroom: "203", teacher: "Волков П.О." },
  { date: "02.09.2025", subject: "Линейная алгебра", time: "12:00-13:30", classroom: "305", teacher: "Орлов В.А." },
  { date: "03.09.2025", subject: "Веб-программирование", time: "12:00-13:30", classroom: "410", teacher: "Николаев Г.И." },
];

// Укажите здесь реальные пути к вашим изображениям на GitHub Pages
const schedulePngsUrls = ["./image1.png", "./image2.png", "./image3.png", "./image4.png"];
